In [1]:
%matplotlib inline

In [2]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [3]:
city_data_to_load = "city_data.csv"
ride_data_to_load = "ride_data.csv"
city_data_to_load = pd.read_csv(city_data_to_load,encoding = "ISO-8859-1")
city_data_to_load.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [4]:
ride_data_to_load = pd.read_csv(ride_data_to_load,encoding = "ISO-8859-1")
ride_data_to_load.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2018-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2018-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2018-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2018-02-10 23:22:03  23.44  5149245426178
4          South Jack  2018-03-06 04:28:35  34.58  3908451377344

In [5]:
city_ride_data = pd.merge(city_data_to_load,ride_data_to_load,on="city")
city_ride_data.head()

          city  driver_count   type                 date   fare        ride_id
0  Richardfort            38  Urban  2018-02-24 08:40:38  13.93  5628545007794
1  Richardfort            38  Urban  2018-02-13 12:46:07  14.00   910050116494
2  Richardfort            38  Urban  2018-02-16 13:52:19  17.92   820639054416
3  Richardfort            38  Urban  2018-02-01 20:18:28  10.26  9554935945413
4  Richardfort            38  Urban  2018-04-17 02:26:37  23.00   720020655850

In [6]:
average_fare= city_ride_data.groupby(["city"]).mean()["fare"].rename("Average Fare")
average_fare_df=pd.DataFrame(average_fare)
average_fare_df.reset_index(level=0,inplace=True)
average_fare_df.round(2)

                     city  Average Fare
0             Amandaburgh         24.64
1             Barajasview         25.33
2           Barronchester         36.42
3             Bethanyland         32.96
4            Bradshawfurt         40.06
5             Brandonfort         35.44
6             Carriemouth         28.31
7         Christopherfurt         24.50
8             Colemanland         30.89
9               Davidfurt         32.00
10              Deanville         25.84
11         East Aaronbury         25.66
12        East Danielview         31.56
13        East Kaylahaven         23.76
14          East Kentstad         29.82
15         East Marymouth         30.84
16              Erikaland         24.91
17              Garzaport         24.12
18            Grahamburgh         25.22
19              Grayville         27.76
20         Harringtonfort         33.47
21            Huntermouth         28.99
22            Hurleymouth         25.89
23               Jerryton         25.65
24            Jessicaport         36.01
25                Johnton         26.79
26           Joneschester         22.29
27             Josephside         32.86
28             Justinberg         23.69
29              Karenberg         26.34
..                    ...           ...
90          South Evanton         26.73
91             South Jack         22.97
92         South Jennifer         35.26
93        South Karenland         26.54
94           South Latoya         20.09
95      South Marychester         41.87
96     South Michelleport         24.45
97          South Phillip         28.57
98        South Saramouth         36.16
99           South Teresa         31.22
100           Taylorhaven         42.26
101          Valentineton         24.64
102          Veronicaberg         32.83
103          Victoriaport         27.78
104           West Angela         25.99
105          West Anthony         24.74
106  West Christopherberg         24.42
107         West Ericstad         22.35
108          West Gabriel         20.35
109           West Hannah         29.55
110          West Heather         33.89
111            West Heidi         23.13
112       West Josephberg         21.72
113         West Kimmouth         29.87
114   West Patrickchester         28.23
115           West Robert         25.12
116      West Samuelburgh         21.77
117       Williamsonville         31.87
118          Williamsstad         24.36
119          Williamsview         26.60

[120 rows x 2 columns]

In [10]:
total_rides=city_ride_data.groupby(["city"]).count()["ride_id"].rename("Total Rides")
total_rides_df=pd.DataFrame(total_rides)
total_rides_df.reset_index(level=0,inplace=True)
total_rides_df.head(5)

            city  Total Rides
0    Amandaburgh           18
1    Barajasview           22
2  Barronchester           16
3    Bethanyland           18
4   Bradshawfurt           10